Revit 2026 API

# FilterNumericValueRule Properties

---

The FilterNumericValueRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |

#### Reference

FilterNumericValueRule Class

Autodesk.Revit.DB Namespace